app/controllers/prototypes_controller.rb

SELECT `prototypes`.* FROM `prototypes`
---
  def index
    @prototypes = Prototype.all

INSERT INTO `prototypes` (`title`, `catch_copy`, `concept`, `user_id`, `created_at`, `updated_at`) VALUES ('ikumaru', 'imo', 'imo', 1, '2021-11-11 04:24:26.010071', '2021-11-11 04:24:26.010071')
---
  def create
    @prototype = Prototype.new(prototype_params)
    if @prototype.save

UPDATE `prototypes` SET `prototypes`.`title` = 'ikumaru6', `prototypes`.`catch_copy` = 'iikuii', `prototypes`.`concept` = 'iikuii', `prototypes`.`updated_at` = '2021-11-11 14:15:37.678044' WHERE `prototypes`.`id` = 3
---
  def update
    # @prototype = Prototype.find(params[:id])
    if @prototype.update(prototype_params)

SELECT `comments`.* FROM `comments` WHERE `comments`.`prototype_id` = 6
---
  def show
    @comment = Comment.new
    @comments = @prototype.comments.includes(:user)

SELECT `prototypes`.* FROM `prototypes` WHERE `prototypes`.`id` = 3 LIMIT 1
DELETE FROM `prototypes` WHERE `prototypes`.`id` = 8
---
  def destroy
    @prototype = Prototype.find(params[:id])
    if @prototype.destroy

SELECT `prototypes`.* FROM `prototypes` WHERE `prototypes`.`id` = 2 LIMIT 1
---
  def set_prototype
    @prototype = Prototype.find(params[:id])